# SteelElementFailures Properties

---
The BuiltInFailuresSteelElementFailures type exposes the following members.
| Name| Description
---|---|---
| SteelElementModifyParametersTaskNotFinished|  Cannot modify parameters while background calculations are in progress.
| SteelElementModifyRangesTaskNotFinished|  Cannot modify ranges while background calculations are in progress.
| SteelElementPreviewTaskNotFinished|  Cannot create preview while background calculations are in progress.
| SteelElementPropagationTaskNotFinished|  Advance Steel propagation tasks not finished.
| SteelElementTaskNotFinished|  Advance Steel tasks not finished.
Top
#### Reference
BuiltInFailuresSteelElementFailures Class
Autodesk.Revit.DB Namespace